package Advanced_Java;

public class TestCase {
    /**
     * Артефакт - артефакт, описывающий совокупность шагов, условий и параметров необходимых для проверки
     * реализации тестируемой функции
     * Action -> Expected Result -> Test Result
     * Open page "login" -> Login page is opened -> Passed
     *
     *
     * модульное тестирование - JUnit (проводится программистом) - низкоуровневое тестирование
     * (тест воспроизводит какие-то данные и воспроизводит действия, далее исполнение тестируемого метода)
     * ожидание сравнивается с результатом Assert (сопоставление)
     * интеграционное тестирование - совместная работа нескольких модулей
     * системное тестирование -  проверка работы системы в целом (тестировщик)
     * */
}
